erp3l/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ВидыЗастрахованныхЛицОбязательногоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗастрахованныхЛицОбязательногоСтрахования</name>
  <enumValues>
    <name>ГражданеРФ</name>
  </enumValues>
  <enumValues>
    <name>ПостоянноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыПостоянноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПроживающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыВременноПроживающие</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцы</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыПризнанныеБеженцами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыНестрахуемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВысококвалифицированныеСпециалистыИзЕАЭС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцыСтрахуемыеФСС</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	БезПроизводныхЗначений = Неопределено;
	Параметры.Свойство("БезПроизводныхЗначений", БезПроизводныхЗначений);
	
	Если БезПроизводныхЗначений = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ, НСтр("ru = 'Гражданин Российской Федерации';
																											|en = 'Citizen of the Russian Federation'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, кроме высококвалифицированных иностранных специалистов';
																															|en = 'Foreign national temporarily staying in the Russian Federation except for highly-skilled foreign specialists'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами, НСтр("ru = 'Иностранец, которому предоставлено временное убежище, временно пребывающий на территории РФ';
																																				|en = 'Foreign national with a temporary granted asylum temporarily staying in the Russian Federation'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы, НСтр("ru = 'Приравнен к гражданам РФ (постоянно проживает, признан беженцем, гражданин страны-участника Договора о ЕАЭС)';
																																|en = 'Person equated to RF citizens (permanently living, recognized as refugees, citizens of the member country of the EAEU Treaty)'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию (как ВКС или в соответствии с международным договором)';
																																		|en = 'Foreign national temporarily staying in the Russian Federation and not subject to insurance in accordance with the international treaty or as a highly-skilled professional'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы, НСтр("ru = 'Иностранец, временно проживающий на территории РФ';
																															|en = 'Foreign national temporarily residing in RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, постоянно проживающий на территории РФ';
																																						|en = 'Highly-skilled foreign specialist or their family member temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи, временно проживающий на территории РФ';
																																					|en = 'Highly-skilled foreign specialist or their family member temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС, НСтр("ru = 'Высококвалифицированный иностранный специалист или член его семьи из страны-участника Договора о ЕАЭС, временно пребывающий на территории РФ';
																																		|en = 'Highly-skilled foreign specialist or their family member from the EAEU countries, temporarily staying in the RF'"));
		ДанныеВыбора.Добавить(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС, НСтр("ru = 'Иностранец, временно пребывающий на территории РФ, не подлежащий страхованию на ОПС и ОМС в соответствии с международным договором';
																																			|en = 'Foreign national temporarily staying in the Russian Federation and not subject to MPI and CMI in accordance with the international treaty'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает категории доходов НДФЛ по дивидендам.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.КатегорииДоходовНДФЛ
//
Функция ВысококвалифицированныеСпециалисты() Экспорт
	
	Категории = Новый Массив;
	Категории.Добавить(ВысококвалифицированныеСпециалистыВременноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыПостоянноПроживающие);
	Категории.Добавить(ВысококвалифицированныеСпециалистыИзЕАЭС);
	
	Возврат Категории;
	
КонецФункции

#КонецОбласти

#КонецЕсли
